[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:6:42
 import { useNavigate } from 'react-router-dom'
 import { bookUtils } from 'main/utils/bookUtils';
 
-export default function BookCreatePage() {
-
-  let navigate = useNavigate(); 
-
-  const onSubmit = async (Book) => {
-    const createdBook = bookUtils.add(Book);
-    console.log("createdBook: " + JSON.stringify(createdBook));
-    navigate("/books");
-  }  
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create New Book</h1>
-        <BookForm submitAction={onSubmit} />
-      </div>
-    </BasicLayout>
-  )
-}
+export default function BookCreatePage() {}
 
killedBy: BookCreatePage tests renders without crashing
statusReason: Error: BookCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:10:36
 
   let navigate = useNavigate(); 
 
-  const onSubmit = async (Book) => {
-    const createdBook = bookUtils.add(Book);
-    console.log("createdBook: " + JSON.stringify(createdBook));
-    navigate("/books");
-  }  
+  const onSubmit = async (Book) => {}  
 
   return (
killedBy: BookCreatePage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Books/BookCreatePage.js:13:14
   const onSubmit = async (Book) => {
     const createdBook = bookUtils.add(Book);
     console.log("createdBook: " + JSON.stringify(createdBook));
-    navigate("/books");
+    navigate("");
   }  
 
killedBy: BookCreatePage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books"
Received: ""

Number of calls: 1

<html>
