[Killed] BlockStatement
main/pages/Books/BookEditPage.js:9:40
 import { useNavigate } from 'react-router-dom'
 
 
-export default function BookEditPage() {
-    let { id } = useParams();
-
-    let navigate = useNavigate(); 
-
-    const response = bookUtils.getById(id);
-
-    const onSubmit = async (Book) => {
-        const updatedBook = bookUtils.update(Book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
-        navigate("/books");
-    }  
-
-    return (
-        <BasicLayout>
-            <div className="pt-2">
-                <h1>Edit Book</h1>
-                <BookForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={response.Book}/>
-            </div>
-        </BasicLayout>
-    )
-}
+export default function BookEditPage() {}
killedBy: BookEditPage tests renders without crashing
statusReason: Error: BookEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:16:38
 
     const response = bookUtils.getById(id);
 
-    const onSubmit = async (Book) => {
-        const updatedBook = bookUtils.update(Book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
-        navigate("/books");
-    }  
+    const onSubmit = async (Book) => {}  
 
     return (
killedBy: BookEditPage tests redirects to /books on submit
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] StringLiteral
main/pages/Books/BookEditPage.js:18:21
 
     const onSubmit = async (Book) => {
         const updatedBook = bookUtils.update(Book);
-        console.log("updatedBook: " + JSON.stringify(updatedBook));
+        console.log("" + JSON.stringify(updatedBook));
         navigate("/books");
     }  
killedBy: BookEditPage tests redirects to /books on submit
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "updatedBook: {\"Book\":{\"id\":3,\"title\":\"It\",\"author\":\"Stephe King\",\"genre\":\"Horror\"}}"
Received string:    "{\"Book\":{\"id\":3,\"title\":\"It\",\"author\":\"Stephe King\",\"genre\":\"Horror\"}}"
