[Killed] BlockStatement
main/pages/Books/BookIndexPage.js:17:44
 
     const showCell = (cell) => JSON.stringify(cell.row.values);
 
-    const deleteCallback = async (cell) => {
-        console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
-        bookUtils.del(cell.row.values.id);
-        navigate("/books");
-    }
+    const deleteCallback = async (cell) => {}
 
     return (
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
main/pages/Books/BookIndexPage.js:20:18
     const deleteCallback = async (cell) => {
         console.log(`BookIndexPage deleteCallback: ${showCell(cell)})`);
         bookUtils.del(cell.row.values.id);
-        navigate("/books");
+        navigate("");
     }
 
killedBy: BookIndexPage tests delete button calls delete and reloads page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/books"
Received: ""

Number of calls: 1

<html>
