[Killed] ArrowFunction
main/pages/Books/BookCreatePage.js:9:31
 
 export default function BooksCreatePage() {
 
-  const objectToAxiosParams = (Book) => ({
-    url: "/api/books/post",
-    method: "POST",
-    params: {
-      title: Book.title,
-      author: Book.author,
-      genre: Book.genre
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (Book) => {
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/Books/BookCreatePage.js:12:13
   const objectToAxiosParams = (Book) => ({
     url: "/api/books/post",
     method: "POST",
-    params: {
-      title: Book.title,
-      author: Book.author,
-      genre: Book.genre
-    }
+    params: {}
   });
 
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "author": "Stephen King",
-   "genre": "Horror",

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:19:31
     }
   });
 
-  const onSuccess = (Book) => {
-    toast(`New Book Created - id: ${Book.id} author: ${Book.author}`);
-  }
+  const onSuccess = (Book) => {}
 
   const mutation = useBackendMutation(
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Book Created - id: 17 author: Stephen King"

Number of calls: 0

[Killed] BlockStatement
main/pages/Books/BookCreatePage.js:36:18
     mutation.mutate(data);
   }
 
-  if (isSuccess) {
-    return <Navigate to="/Books/list" />
-  }
+  if (isSuccess) {}
 
   return (
killedBy: BookCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/Books/list"}

Number of calls: 0
