[Killed] ObjectLiteral
main/pages/Books/BookDetailsPage.js:18:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/books?id=${id}`],
-      { // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-        method: "GET", 
-        url: "/api/books", 
-        params: {
-          id
-        } 
-      }
+      {}
     );
     
killedBy: BookDetailsPage tests renders without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Books/BookDetailsPage.js:31:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        {book && <BookTable books={[book]} currentUser={currentUser} showButtons={false}/>}
+        {true}
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests renders without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Books/BookDetailsPage.js:31:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Book Details</h1>
-        {book && <BookTable books={[book]} currentUser={currentUser} showButtons={false}/>}
+        {false}
       </div>
     </BasicLayout>
killedBy: BookDetailsPage tests renders without crashing for regular user
statusReason: Error: Unable to find an element by: [data-testid="BookTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
