[Killed] ArrowFunction
main/pages/Books/BookEditPage.js:25:34
     );
 
 
-  const objectToAxiosPutParams = (Book) => ({
-    url: "/api/books",
-    method: "PUT",
-    params: {
-      id: Book.id,
-    },
-    data: {
-      title: Book.title,
-      author: Book.author,
-      genre: Book.genre
-    }
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (Book) => {
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: IT2 author: Stephen King2 genre: Horror2"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/Books/BookEditPage.js:38:31
     }
   });
 
-  const onSuccess = (Book) => {
-    toast(`Book Updated - id: ${Book.id} title: ${Book.title} author: ${Book.author} genre: ${Book.genre}`);
-  }
+  const onSuccess = (Book) => {}
 
   const mutation = useBackendMutation(
killedBy: BookEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Book Updated - id: 17 title: IT2 author: Stephen King2 genre: Horror2"

Number of calls: 0

[Killed] ConditionalExpression
main/pages/Books/BookEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Book</h1>
-        {Book &&
-          <BookForm initialContents={Book} submitAction={onSubmit} buttonLabel="Update" />
+        {true
         }
       </div>
killedBy: BookEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="BookForm-title"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Books/BookEditPage.js:63:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Book</h1>
-        {Book &&
-          <BookForm initialContents={Book} submitAction={onSubmit} buttonLabel="Update" />
+        {Book || <BookForm initialContents={Book} submitAction={onSubmit} buttonLabel="Update" />
         }
       </div>
killedBy: BookEditPage tests when the backend doesn't return a book renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="BookForm-title" id="title" name="title" type="text" /> instead
