[Killed] BlockStatement
main/pages/Restaurants/RestaurantDetailsPage.js:7:49
 import { useBackend } from 'main/utils/useBackend';
 import { useCurrentUser } from 'main/utils/currentUser'
 
-export default function RestaurantDetailsPage() {
-  let { id } = useParams();
-  const currentUser = useCurrentUser();
-
-  const { data: restaurants, error: _error, status: _status } =
-    useBackend(
-      // Stryker disable next-line all : don't test internal caching of React Query
-      [`/api/restaurant?id=${id}`],
-      { // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET", url: "/api/restaurant",
-      params: {
-        id
-      }
-      }
-    );
-
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Restaurant Details</h1>
-        {restaurants && <RestaurantTable restaurants={[restaurants]} currentUser={currentUser} />}
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RestaurantDetailsPage() {}
 
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: Error: RestaurantDetailsPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] ObjectLiteral
main/pages/Restaurants/RestaurantDetailsPage.js:15:7
     useBackend(
       // Stryker disable next-line all : don't test internal caching of React Query
       [`/api/restaurant?id=${id}`],
-      { // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET", url: "/api/restaurant",
-      params: {
-        id
-      }
-      }
+      {}
     );
 
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] LogicalOperator
main/pages/Restaurants/RestaurantDetailsPage.js:27:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        {restaurants && <RestaurantTable restaurants={[restaurants]} currentUser={currentUser} />}
+        {restaurants || <RestaurantTable restaurants={[restaurants]} currentUser={currentUser} />}
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'subRows')

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantDetailsPage.js:27:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Restaurant Details</h1>
-        {restaurants && <RestaurantTable restaurants={[restaurants]} currentUser={currentUser} />}
+        {false}
       </div>
     </BasicLayout>
killedBy: RestaurantDetailsPage tests renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="RestaurantTable-cell-row-0-col-id"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
