[Killed] ArrowFunction
main/pages/Restaurants/RestaurantEditPage.js:27:36
       );
   
   
-    const objectToAxiosPutParams = (restaurant) => ({
-      url: "/api/restaurant",
-      method: "PUT",
-      params: {
-        id: restaurant.id,
-      },
-      data: {
-        name: restaurant.name,
-        address: restaurant.address,
-        city: restaurant.city,
-        state: restaurant.state,
-        zip: restaurant.zip,
-        description: restaurant.description
-      }
-    });
+    const objectToAxiosPutParams = () => undefined;
   
     const onSuccess = (restaurant) => {
killedBy: RestaurantEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant Updated - id: 17 name: The"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:68:12
       <BasicLayout>
         <div className="pt-2">
           <h1>Edit restaurant</h1>
-          {restaurant &&
-            <RestaurantForm initialContents={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+          {true
           }
         </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ConditionalExpression
main/pages/Restaurants/RestaurantEditPage.js:68:12
       <BasicLayout>
         <div className="pt-2">
           <h1>Edit restaurant</h1>
-          {restaurant &&
-            <RestaurantForm initialContents={restaurant} submitAction={onSubmit} buttonLabel="Update" />
+          {false
           }
         </div>
killedBy: RestaurantEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="RestaurantForm-name"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
