[Killed] BlockStatement
main/pages/Restaurants/RestaurantIndexPage.js:8:47
 import { useCurrentUser } from 'main/utils/currentUser'
 
 
-export default function RestaurantIndexPage() {
-    const currentUser = useCurrentUser();
-
-    const { data: restaurants, error: _error, status: _status } =
-      useBackend(
-        // Stryker disable next-line all : don't test internal caching of React Query
-        ["/api/restaurant/all"],
-        { method: "GET", url: "/api/restaurant/all" },
-        []
-      );
-  
-    return (
-      <BasicLayout>
-        <div className="pt-2">
-          <h1>Restaurants</h1>
-          <RestaurantTable restaurants={restaurants} currentUser={currentUser} />
-        </div>
-      </BasicLayout>
-    )
-}
+export default function RestaurantIndexPage() {}
killedBy: RestaurantIndexPage tests renders without crashing for regular user
statusReason: Error: RestaurantIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.

[Killed] StringLiteral
main/pages/Restaurants/RestaurantIndexPage.js:15:19
       useBackend(
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/restaurant/all"],
-        { method: "GET", url: "/api/restaurant/all" },
+        { method: "", url: "/api/restaurant/all" },
         []
       );
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/restaurant/all"
Received string:    "Error communicating with backend via  on /api/restaurant/all"

[Killed] ArrayDeclaration
main/pages/Restaurants/RestaurantIndexPage.js:16:9
         // Stryker disable next-line all : don't test internal caching of React Query
         ["/api/restaurant/all"],
         { method: "GET", url: "/api/restaurant/all" },
-        []
+        ["Stryker was here"]
       );
   
killedBy: RestaurantIndexPage tests renders empty table when backend unavailable, user only
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td data-testid="RestaurantTable-cell-row-0-col-id" role="cell" /> instead
