[Killed] BlockStatement
src/main/utils/restaurantUtils.js:9:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/restaurant",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 // get restaurants from local storage
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:10:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/restaurant",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/utils/restaurantUtils.js:11:14
 
 export function cellToAxiosParamsDelete(cell) {
     return {
-        url: "/api/restaurant",
+        url: "",
         method: "DELETE",
         params: {
killedBy: RestaurantIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "Restaurant with id 2 was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:27:40
         return set(restaurantCollection);
     }
     const restaurantCollection = JSON.parse(restaurantValue);
-    if (restaurantCollection === null) {
-        const restaurantCollection = { nextId: 1, restaurants: [] }
-        return set(restaurantCollection);
-    }
+    if (restaurantCollection === null) {}
     return restaurantCollection;
 };
killedBy: restaurantUtils tests get When restaurants is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "restaurants": []}
Received: null

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:27:9
         return set(restaurantCollection);
     }
     const restaurantCollection = JSON.parse(restaurantValue);
-    if (restaurantCollection === null) {
+    if (false) {
         const restaurantCollection = { nextId: 1, restaurants: [] }
         return set(restaurantCollection);
killedBy: restaurantUtils tests get When restaurants is null in local storage, should set to empty list
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"nextId": 1, "restaurants": []}
Received: null

[Killed] ArrowFunction
src/main/utils/restaurantUtils.js:42:41
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == id);
+    const index = restaurants.findIndex(() => undefined);
     if (index === -1) {
         return { "error": `restaurant with id ${id} not found` };
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "restaurant": Object {
-     "address": "879 Embarcadero del Norte",

[Killed] UnaryOperator
src/main/utils/restaurantUtils.js:43:19
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
+    if (index === +1) {
         return { "error": `restaurant with id ${id} not found` };
     }
killedBy: restaurantUtils tests getById Check that getting a restaurant by id works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

  Object {
-   "restaurant": Object {
-     "address": "879 Embarcadero del Norte",

[Killed] EqualityOperator
src/main/utils/restaurantUtils.js:72:48
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == restaurant.id);
+    const index = restaurants.findIndex((r) => r.id != restaurant.id);
     if (index === -1) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 6

@@ -5,20 +5,20 @@
        Object {
          "address": "170 Aero Camino",

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:72:48
     const restaurants = restaurantCollection.restaurants;
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
-    const index = restaurants.findIndex((r) => r.id == restaurant.id);
+    const index = restaurants.findIndex((r) => true);
     if (index === -1) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
killedBy: restaurantUtils tests update Check that updating an non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 28

  Object {
-   "error": "restaurant with id 99 not found",
+   "restaurantCollection": Object {

[Killed] ConditionalExpression
src/main/utils/restaurantUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
-    if (index === -1) {
+    if (false) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
     }
killedBy: restaurantUtils tests update Check that updating an non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 32

  Object {
-   "error": "restaurant with id 99 not found",
+   "restaurantCollection": Object {

[Killed] EqualityOperator
src/main/utils/restaurantUtils.js:73:9
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
-    if (index === -1) {
+    if (index !== -1) {
         return { "error": `restaurant with id ${restaurant.id} not found` };
     }
killedBy: restaurantUtils tests update Check that updating an existing restaurant works
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 32
+ Received  +  1

  Object {
-   "restaurantCollection": Object {
-     "nextId": 5,

[Killed] ObjectLiteral
src/main/utils/restaurantUtils.js:74:16
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
     if (index === -1) {
-        return { "error": `restaurant with id ${restaurant.id} not found` };
+        return {};
     }
     restaurants[index] = restaurant;
killedBy: restaurantUtils tests update Check that updating an non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "error": "restaurant with id 99 not found",
- }

[Killed] StringLiteral
src/main/utils/restaurantUtils.js:74:27
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == restaurant.id);
     if (index === -1) {
-        return { "error": `restaurant with id ${restaurant.id} not found` };
+        return { "error": `` };
     }
     restaurants[index] = restaurant;
killedBy: restaurantUtils tests update Check that updating an non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "error": "restaurant with id 99 not found",
+   "error": "",

[Killed] BlockStatement
src/main/utils/restaurantUtils.js:91:23
 
     /* eslint-disable-next-line eqeqeq */ // we really do want == here, not ===
     const index = restaurants.findIndex((r) => r.id == id);
-    if (index === -1) {
-        return { "error": `restaurant with id ${id} not found` };
-    }
+    if (index === -1) {}
     restaurants.splice(index, 1);
     set(restaurantCollection);
killedBy: restaurantUtils tests del Check that deleting a non-existing restaurant returns an error
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  -  1
+ Received  + 23

  Object {
-   "error": "restaurant with id 99 not found",
+   "restaurantCollection": Object {
